Documents/Requests/WebAPI SOAP Action_23_02_2022_07_53_41_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                    <ID>8bc4f35a-6b66-4794-8371-343da5bdab4d</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>cda2362a-14f4-4094-9216-d0df3286c53d</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T04:54:39.513Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>KS_</GlobalID>
                    <Mode>1</Mode>
                    <SourceSystemID> </SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>